In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [ ]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)),
                  columns = cols)
df

In [7]:
df.query('A > 10')

    A   B  C   D   E
0  11  17  6  18  18
1  19   4  1  17   3
3  14  19  1   3   1

In [5]:
rerata = df['A'].mean()
rerata

11.8

In [6]:
df.query('A > @rerata')

    A   B  C   D  E
1  19   4  1  17  3
3  14  19  1   3  1